public class Main {
    public static void main(String[] args) {

        int ticket_price = 5; // Объявляете переменные для входных данных и
        int bonus = 20; // параметров программы: одну для хранения

        int miles = ticket_price / bonus; // стоимости билета, другую для хранения количества

        System.out.println("Начислено бонусных миль: " + miles);// рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}
